In [4]:
import scipy as sp
import pandas as pd
import ast

In [5]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks',
'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts',
'Scouts', 'Scouts', 'Scouts'],'company': ['1st', '1st', '2nd', '2nd',
'1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],'name': ['Miller',
'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan',
'Piger', 'Riani', 'Ali'],'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3,
2, 3],'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [6]:
data = pd.DataFrame(raw_data)

In [21]:
data[data.company == '1st']

  company      name  postTestScore  preTestScore    regiment
0     1st    Miller             25             4  Nighthawks
1     1st  Jacobson             94            24  Nighthawks
4     1st     Cooze             70             3    Dragoons
5     1st     Jacon             25             4    Dragoons
8     1st     Sloan             62             2      Scouts
9     1st     Piger             70             3      Scouts

In [36]:
data[data ['regiment'] == 'Nighthawks']

  company      name  postTestScore  preTestScore    regiment
0     1st    Miller             25             4  Nighthawks
1     1st  Jacobson             94            24  Nighthawks
2     2nd       Ali             57            31  Nighthawks
3     2nd    Milner             62             2  Nighthawks

In [44]:
sp.mean(data[data ['regiment'] == 'Nighthawks']['preTestScore'])

15.25

In [22]:
nb_company = data['company'].unique()
nb_company

array(['1st', '2nd'], dtype=object)

In [49]:
for i in range(len(nb_company)):
    print('Sum pretTestScore for ',nb_company[i],' company:',
          sp.sum(data[data ['company'] == nb_company[i]]['preTestScore']))
    print('Sum posttTestScore for ',nb_company[i],' company:',
          sp.sum(data[data ['company'] == nb_company[i]]['postTestScore']))
    print('mean pretTestScore for ',nb_company[i],' company:',
          sp.mean(data[data ['company'] == nb_company[i]]['preTestScore']))

Sum pretTestScore for  1st  company: 40
Sum posttTestScore for  1st  company: 346
mean pretTestScore for  1st  company: 6.666666666666667
Sum pretTestScore for  2nd  company: 93
Sum posttTestScore for  2nd  company: 402
mean pretTestScore for  2nd  company: 15.5

In [102]:
data.groupby(['company']).sum()

         postTestScore  preTestScore
company
1st                346            40
2nd                402            93

In [106]:
grouped = data.groupby(['regiment','company']).sum()
grouped

                    postTestScore  preTestScore
regiment   company
Dragoons   1st                 95             7
           2nd                151            55
Nighthawks 1st                119            28
           2nd                119            33
Scouts     1st                132             5
           2nd                132             5

In [73]:
print(grouped.postTestScore)

                    postTestScore  preTestScore
regiment   company
Dragoons   1st                 95             7
           2nd                151            55
Nighthawks 1st                119            28
           2nd                119            33
Scouts     1st                132             5
           2nd                132             5
regiment    company
Dragoons    1st         95
            2nd        151
Nighthawks  1st        119
            2nd        119
Scouts      1st        132
            2nd        132
Name: postTestScore, dtype: int64

In [58]:
sp.mean(grouped['preTestScore'])

22.166666666666668

In [61]:
grp_regiment = data.groupby(['regiment','company']).sum()

In [87]:
grp_regiment

                    postTestScore  preTestScore
regiment   company
Dragoons   1st                 95             7
           2nd                151            55
Nighthawks 1st                119            28
           2nd                119            33
Scouts     1st                132             5
           2nd                132             5

In [91]:
for reg in data.groupby(['regiment','company']):
    print(reg)

(('Dragoons', '1st'),   company   name  postTestScore  preTestScore  regiment
4     1st  Cooze             70             3  Dragoons
5     1st  Jacon             25             4  Dragoons)
(('Dragoons', '2nd'),   company    name  postTestScore  preTestScore  regiment
6     2nd  Ryaner             94            24  Dragoons
7     2nd    Sone             57            31  Dragoons)
(('Nighthawks', '1st'),   company      name  postTestScore  preTestScore    regiment
0     1st    Miller             25             4  Nighthawks
1     1st  Jacobson             94            24  Nighthawks)
(('Nighthawks', '2nd'),   company    name  postTestScore  preTestScore    regiment
2     2nd     Ali             57            31  Nighthawks
3     2nd  Milner             62             2  Nighthawks)
(('Scouts', '1st'),   company   name  postTestScore  preTestScore regiment
8     1st  Sloan             62             2   Scouts
9     1st  Piger             70             3   Scouts)
(('Scouts', '2nd'),    company   name  postTestScore  preTestScore regiment
10     2nd  Riani             62             2   Scouts
11     2nd    Ali             70             3   Scouts)

In [92]:
group = data.groupby(['regiment','company'])

In [99]:
group.groups

{('Dragoons', '1st'): [4, 5],
 ('Dragoons', '2nd'): [6, 7],
 ('Nighthawks', '1st'): [0, 1],
 ('Nighthawks', '2nd'): [2, 3],
 ('Scouts', '1st'): [8, 9],
 ('Scouts', '2nd'): [10, 11]}